Revit 2027 API
StructuralSectionRound.NameKey Property
 Name Key
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string NameKey { get; set; }
Public Property NameKey As String
	Get
	Set
public:
property String^ NameKey {
	String^ get ();
	void set (String^ value);
}
member NameKey : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace